guests = ['сергій жадан', 'василь стус', 'в\'ячеслав чорновіл']

print(f"{guests[0].title()} запрошую вас до себе на вечерю!")
print(f"{guests[1].title()} запрошую вас до себе на вечерю!")
print(f"{guests[2].title()} запрошую вас до себе на вечерю!")

print("")
print(f"{guests[-1].title()} не зможе прийти на вечерю.")
guests[-1] = 'ліна костенко'

print("")
print(f"{guests[0].title()} запрошую вас до себе на вечерю!")
print(f"{guests[1].title()} запрошую вас до себе на вечерю!")
print(f"{guests[2].title()} запрошую вас до себе на вечерю!")