guests = ['сергій жадан', 'василь стус', 'в\'ячеслав чорновіл']

print(f"{guests[0].title()} запрошую вас до себе на вечерю!")
print(f"{guests[1].title()} запрошую вас до себе на вечерю!")
print(f"{guests[2].title()} запрошую вас до себе на вечерю!")

print("")
print(f"{guests[-1].title()} не зможе прийти на вечерю.")
guests[-1] = 'ліна костенко'

print("")
print(f"{guests[0].title()} запрошую вас до себе на вечерю!")
print(f"{guests[1].title()} запрошую вас до себе на вечерю!")
print(f"{guests[2].title()} запрошую вас до себе на вечерю!")

print("")
print("Дорогі друзі! Я знайшов більший стіл, ому зможу запросити більше гостей.")

guests.insert(0, 'микола хвильовий')
guests.insert(3, 'сергій параджанов')
guests.append('василь симоненко')

print("")
print(f"{guests[0].title()} запрошую вас до себе на вечерю!")
print(f"{guests[1].title()} запрошую вас до себе на вечерю!")
print(f"{guests[2].title()} запрошую вас до себе на вечерю!")
print(f"{guests[3].title()} запрошую вас до себе на вечерю!")
print(f"{guests[4].title()} запрошую вас до себе на вечерю!")
print(f"{guests[-1].title()} запрошую вас до себе на вечерю!")